In [16]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sbn

In [17]:
data = pd.read_csv('C:/Users/Kishor/Desktop/AI ML/Assignment DataSets/titles.csv')
data.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [20]:
data["title"].count()

244914

### What are the earliest two films listed in the titles dataframe?

In [22]:
data.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [24]:
data[(data.title=="Hamlet")].title.count()

20

### How many movies are titled "North by Northwest"?

In [28]:
data[(data.title=="North by Northwest")].title.count()

1

### When was the first movie titled "Hamlet" made?

In [31]:
d = data[(data.title=="Hamlet")]
d.sort_values("year").head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [33]:
Treasure = data[data.title=="Treasure Island"]
Treasure.sort_values("title")

                  title  year
27076   Treasure Island  1999
37238   Treasure Island  1973
55686   Treasure Island  1918
65051   Treasure Island  1972
77354   Treasure Island  1950
141822  Treasure Island  1934
173051  Treasure Island  1985
196514  Treasure Island  1920

### How many movies were made in the year 1950?

In [41]:
d1 = data[(data.year==1950)].year.count()
d1

1113

### How many movies were made in the year 1960?

In [42]:
d2 = data[(data.year==1960)].year.count()
d2

1549

### How many movies were made from 1950 through 1959?

In [48]:
data[(data.year>=1950) & (data.year<=1959)].year.count()

12934

### In what years has a movie titled "Batman" been released?

In [49]:
data[(data.title=="Batman")]

         title  year
39349   Batman  1943
240896  Batman  1989

In [50]:
import pandas as pd

In [51]:
data1 = pd.read_csv("C:/Users/Kishor/Desktop/AI ML/Assignment DataSets/cast.csv")

In [52]:
data1.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many roles were there in the movie "Inception"?

In [54]:
data1[(data1.title=="Inception")].title.count()

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [62]:
data1[(data1.title=="Inception")].n.isnull().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [61]:
data1[(data1.title=="Inception")].n.notnull().sum()

51

In [63]:
data1.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [76]:
d2 = data1[(data1.title=="North by Northwest")].sort_values("n")

In [77]:
d2.dropna()

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [93]:
d3 = data1[(data1.title=="Sleuth") & (data1.year==1972)].head()

In [94]:
d4 =  d3.sort_values("n")
d4

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [99]:
d5 = data1[(data1.title=="Sleuth") & (data1.year==2007)]

In [100]:
d6 =d5.sort_values("n")
d6

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [117]:
data1[(data1.title=="Hamlet") & (data1.year==1921)].title.count()

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [112]:
data1[(data1.year==1996) & (data1.title=="Hamlet")].title.count()

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [113]:
data1[(data1.title=="Hamlet")].title.count()

342

### How many people have played an "Ophelia"?

In [118]:
data1[(data1.character=="Ophelia")].character.count()

117

### How many people have played a role called "The Dude"?

In [119]:
data1[(data1.character=="The Dude")].character.count()

19

### How many people have played a role called "The Stranger"?

In [120]:
data1[(data1.character=="The Stranger")].character.count()

212

### How many roles has Sidney Poitier played throughout his career?

In [122]:
data1[(data1.name=="Sidney Poitier")].character.count()

43

### How many roles has Judi Dench played?

In [123]:
data1[(data1.name=="Judi Dench")].character.count()

55

In [124]:
data1.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [127]:
data1[(data1.name=="Cary Grant") & (data1.year==1940) &(data1.n==2)]

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [128]:
data1[(data1.name=="Cary Grant") & (data1.year==1940)]

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871423,My Favorite Wife,1940,Cary Grant,actor,Nick Arden,2.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s?

In [134]:
data1[(data1.year==1950) & (data1.type=="actor")].character.count()

16760

### How many roles were available for actresses in the 1950s?

In [136]:
data1[(data1.year==1950) & (data1.type=="actress")].character.count()

5637

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [139]:
data1[(data1.n==1) & (data1.year<=1980)].year.count()

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [140]:
data1[(data1.n!=1) & (data1.year<=1980)].year.count()

1117667

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [141]:
data1[(data1.n.isnull()) & (data1.year<=1980)].year.count()

448347